In [1]:
import numpy as np
import pandas as pd

***create DataFrame***

In [2]:
data = {'Company':['Genpact','Accenture','Cognizant','Cognizant','Genpact','Accenture'],
        'Person': ['Aadil','Prashant', 'Neha','Simran','Mayank','Hasan'],
        'Sales':[100,120,340,80,150,230]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

     Company    Person  Sales
0    Genpact     Aadil    100
1  Accenture  Prashant    120
2  Cognizant      Neha    340
3  Cognizant    Simran     80
4    Genpact    Mayank    150
5  Accenture     Hasan    230

In [7]:
df.groupby('Company')

In [8]:
df.groupby('Company').mean()

           Sales
Company
Accenture    175
Cognizant    210
Genpact      125

In [9]:
df.groupby('Company').sum()

           Sales
Company
Accenture    350
Cognizant    420
Genpact      250

In [10]:
By_Comp = df.groupby('Company')  # we can asssign a variable to apply aggregate fn

In [11]:
By_Comp.mean()

           Sales
Company
Accenture    175
Cognizant    210
Genpact      125

In [12]:
By_Comp.std()

                Sales
Company
Accenture   77.781746
Cognizant  183.847763
Genpact     35.355339

In [13]:
By_Comp.min()

          Person  Sales
Company
Accenture  Hasan    120
Cognizant   Neha     80
Genpact    Aadil    100

In [14]:
By_Comp.max()

             Person  Sales
Company
Accenture  Prashant    230
Cognizant    Simran    340
Genpact      Mayank    150

In [15]:
By_Comp.count()

           Person  Sales
Company
Accenture       2      2
Cognizant       2      2
Genpact         2      2

In [32]:
By_Comp.describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
Accenture   2.0  175.0   77.781746  120.0  147.5  175.0  202.5  230.0
Cognizant   2.0  210.0  183.847763   80.0  145.0  210.0  275.0  340.0
Genpact     2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0

In [37]:
By_Comp.describe().transpose()

Company       Accenture   Cognizant     Genpact
Sales count    2.000000    2.000000    2.000000
      mean   175.000000  210.000000  125.000000
      std     77.781746  183.847763   35.355339
      min    120.000000   80.000000  100.000000
      25%    147.500000  145.000000  112.500000
      50%    175.000000  210.000000  125.000000
      75%    202.500000  275.000000  137.500000
      max    230.000000  340.000000  150.000000

In [38]:
By_Comp.describe().transpose()['Genpact']

Sales  count      2.000000
       mean     125.000000
       std       35.355339
       min      100.000000
       25%      112.500000
       50%      125.000000
       75%      137.500000
       max      150.000000
Name: Genpact, dtype: float64

In [39]:
By_Comp.describe().transpose()['Accenture']

Sales  count      2.000000
       mean     175.000000
       std       77.781746
       min      120.000000
       25%      147.500000
       50%      175.000000
       75%      202.500000
       max      230.000000
Name: Accenture, dtype: float64

# Great Job!